[{"name":"Gretchen Whitmer","party":"Democrat","bio":{"occupation":"Candidate for Governor","education":"Michigan State University College of Law Michigan State University, BA Communications","qualifications":"Michigan State Representative from the 69 th District 2000-2006 Michigan State Senator from the 23 rd District 2006-2015 Minority Leader of the Michigan Senate 2011-2015 Ingham County Prosecutor July 2016-December 2016"},"policies":[{"PRIORITIES: What are your top three priorities for the State of Michigan and how would you address them?":"Fixing the roads by investing $3 billion per year in the Rebuild Michigan Infrastructure Bank to rebuild our crumbling infrastructure, including water pipelines and expanding access to broadband. Making health care more affordable for families, like when I worked across the aisle to expand Medicaid to cover over 680,000 Michiganders. I’ll take on Trump and Republicans who threaten our health coverage and protect people with pre-existing conditions. Making the first two years of college debt-free and funding more trade schools and skills training programs so Michiganders can get a good job and support their families."},{"EDUCATION: What measures do you support/propose to achieve improved educational outcomes and accessibility for Michigan students from early childhood through post-secondary education?":"The key to a good job is a good education. My Good Schools Now education plan will: put Michigan on a path to universal preschool; triple the number of literacy coaches in our schools; respect our educators and treat them as professionals instead of attacking them for Lansing’s policy failures; expand career counseling and skilled trades training so every student has a path to a high-wage job, whether college is right for them or not; hold all schools to the same high proficiency standards – traditional and charter schools alike."},{"ECONOMY: What policies do you support to increase jobs and help Michigan residents improve their economic positions?":"My Better Skills, Better Job plan focuses on raising household incomes by expanding education and skills training, investing in our infrastructure, aggressively pursuing economic development and supporting small business growth so that everyone has a path to a good job and a secure future. We must also raise the minimum wage to $15 and enact strong paid family leave policies to help working families get ahead. My administration will also adopt strong Buy American, Buy Michigan policies to ensure more of our tax dollars go to Michigan businesses that hire Michigan workers."},{"ENVIRONMENT & ENERGY: What actions or policies do you support to protect Michigan’s water, air and land for current and future generations, while meeting the state’s energy needs? Explain how those actions or policies would affect the future of Enbridge Pipeline 5.":"Diversifying Michigan’s energy generation portfolio is good for our environment and our economy. I support increased investment in the renewable energy sector of the economy and the 92,000 Michigan jobs it supports. Michigan is home to 21% of the Earth’s fresh water, and we’ve got to protect it. An oil spill in the Great Lakes would be an absolutely devastating blow to our environment and our economy. My administration will immediately file to enjoin the easement and begin the legal process for shutting down Line 5."},{"EQUALITY: What, if any, specific steps will you take to address inequalities facing women in Michigan?":"I have always been on the front lines fighting for women’s rights. As Senate Democratic Leader, I shared my own story of surviving sexual assault to fight Republican efforts to erect more barriers for women in their health care. As Ingham County prosecutor, I established a new domestic violence unit, and I recently released a plan to combat sexual assault on campus. As governor, I will fight for equal pay and end pay disparities for women of color, enact earned paid sick leave, and ensure quality, affordable childcare, because the average cost of infant care in Michigan is too high."},{"JUSTICE: What policies will you pursue to promote social and racial justice in our state?":"We’ve got to level the playing field so the amount of money in your bank account does not determine the level of justice you receive. That’s why as Prosecutor, I prioritized rehabilitation programs for nonviolent first-time offenders. As governor, I’m committed to building a diverse cabinet that represents every community in Michigan so every voice is heard. I support universal voter access, so everyone who is approved for a driver’s license or state ID should be automatically registered to vote, and any registered voter should be able to vote absentee or by mail."}]},{"name":"Debbie Stabenow","party":"Democrat","bio":{"occupation":"U.S. Senator","education":"Michigan State University, B.A, MSW","qualifications":"As the first woman elected to the United States Senate from Michigan, I have a strong record of getting things done for Michigan families. I will continue to be a champion for Michigan and to work across the aisle to help move Michigan forward."},"policies":[{"PRIORITIES: What are your top three national legislative priorities and how would you address them?":"One of my top priorities is helping create jobs in Michigan. I am focused on growing a diverse economy that includes manufacturing and technology, small business creation and agriculture, education and career training. The first bill I passed into law as a U.S. Senator banned oil and gas drilling in the Great Lakes. I authored the Great Lakes Restoration Initiative that has been successful in cleaning up our waters and led the fight to restore funding after President Trump tried to zero it out. I have been a champion for Michigan agriculture and rural communities and authored the 2014 and 2018 bipartisan Farm Bills."},{"IMMIGRATION: What are your concerns and plans regarding U.S. immigration polices?":"I have heard from thousands of Michigan citizens about their concerns with our broken immigration system and there is no question that we need comprehensive immigration reform that works for our families, workers, businesses, and farmers each and every day. I support the DREAM Act, the Keep Families Together Act, and comprehensive immigration reform."},{"HEALTH CARE: What are your concerns and plans regarding U.S. health coverage policies and programs, including those affecting maternal and child health?":"Health care is a human right and everyone should have affordable, quality health care. I helped lead the fight to stop Republicans from dismantling our health care system and taking away health care from millions of Americans, and am focused on lowering health care and drug costs for Michigan families. I led bipartisan efforts to increase funding for community health centers and extend the Children’s Health Insurance Program, which 100,000 children in Michigan rely on, and am working to pass my Quality Care for Moms and Babies Act to provide funding for new partnerships to improve maternity and infant care."},{"ECONOMY: What federal policies do you support to help members of all strata of the American public improve their economic positions?":"Everyone deserves a fair shot to work hard and be successful. And right now, that fair shot is not available to everyone in Michigan or our country. Work should be rewarded – in our tax code, in our wages, and in our quality of life. If you work full time, you should not be in poverty. I know that not every young person will pursue a four-year college degree. I am working with businesses, building and construction trades, parents, students, and educators to promote job opportunities in skilled trades and technical careers. If we make things and grow things in Michigan, our families will be able to stay in Michigan."},{"ENVIRONMENT & ENERGY: What policies do you support to meet U.S. energy needs while protecting our water, air and land for current and future generations? Explain how those actions or policies would affect the future of the Great Lakes.":"I have lived in Michigan my whole life and understand that our Great Lakes are vital to our economy and Michigan way of life. That is why I authored the Great Lakes Restoration Initiative, which has been successful in cleaning up our waters. I will continue working to protect the Great Lakes for the next generation. We can protect our environment while creating new clean energy jobs. It’s critical that we reduce our dependence on fossil fuels. We should continue investing in clean energy technologies – a wind turbine is made with over 8,000 parts, every one of which can be made in Michigan."},{"ELECTIONS: What federal policies do you support regarding campaign funding and voting rights?":"All voters must be able to cast their votes without barriers, fear, or intimidation. That is why I am a cosponsor of the Voting Rights Advancement Act, and will continue pushing to make sure elections are fair and transparent. It’s so important that we reduce the influence of special interests in our election. I strongly oppose the Supreme Court’s Citizens United decision. I also cosponsored and voted for the DISCLOSE Act that would cut down on dark money. You can count on me to continue fighting for the people of Michigan every day in the U.S. Senate."}]},{"name":"Debbie Dingell","party":"Democrat","bio":{"occupation":"U.S. Representative, MI-12","education":"BSFS, Foreign Service, Georgetown University, 1975 and MA, Liberal Studies, Georgetown University, 1998","qualifications":"President, General Motors Foundation and Executive Director of Public Affairs, GM; Chair, Manufacturing Initiative at the American Automotive Policy Council; President, D2 Strategies. U.S. Representative, 12th District; Wayne State Board of Governors (2007-2014 – Chair, 2012-2014)"},"policies":[{"PRIORITIES: What are your top three national legislative priorities and how would you address them?":"The people I represent have basic needs; they want to be able to make a decent living and provide for their family. They want to be able to buy a home and live in a safe neighborhood, educate their children, put food on the table, see a doctor when they need to, afford their medicine and have a secure retirement. To this end, my top 3 priorities are ensuring every American has access to quality affordable health insurance, supporting our economy by strengthening manufacturing, ending bad trade deals that ship jobs overseas, and protecting our environment, and putting worker’s pensions back on solid ground."},{"IMMIGRATION: What are your concerns and plans regarding U.S. immigration policy?":"We need comprehensive immigration reform. Our national security must always be our top priority. We are a nation of immigrants, and my district has diverse and thriving communities. Comprehensive reform should also offer a pathway to citizenship to people who have been here for years, paid taxes and not committed crimes, fill economic needs including in agriculture, hospitality and construction, and protect Dreamers – young adults brought here by their parents when they were children."},{"HEALTH CARE: What are your concerns and plans regarding U.S. health care policies and programs, including those affecting maternal and child health?":"Every American has the right to affordable, quality healthcare. Protecting and improving the Affordable Care Act is one of my top priorities in Congress; we need to address increasing premiums and high deductibles, to reduce the cost of medicines and repeal the “Cadillac” tax among others. We must ensure we have strong paid sick and family leave, support the Children’s Health Insurance Program and protect the Medicaid expansion which is critical to many Michigan families. I am also a cosponsor of HR 676, the Expanded and Improved Medicare for All Act – which I believe is a good vision for the future of healthcare."},{"ECONOMY: What federal policies do you support to help members of all strata of the American public improve their economic positions?":"We need to ensure every American has equal economic opportunity. This means making sure we have good affordable housing and clean air to breath and clean water to drink. It means making sure college is affordable for all families, and that every American has a right to affordable, quality healthcare. It means protecting our safety net, like Social Security, Medicare and Medicaid, to ensure that families can still put food on the table, see a doctor and afford medicine during an economic downturn. It also means we should raise the national minimum wage and fix our bad trade deals that ship jobs overseas."},{"ENVIRONMENT & ENERGY: What policies do you support to meet U.S. energy needs while protecting our water, air and land for current and future generations? Explain how those actions or policies would affect the future of the Great Lakes.":"We need an all-of-the above energy strategy with an emphasis on renewable energy. I opposed President Trump's decision to repeal the Clean Power Plan and to withdraw from the Paris Accords, both of which will have negative impacts on both our economy and our environment. The most important thing we can do to protect the Great Lakes is to fund the Great Lakes Restoration Initiative at $300 million per year and continue to reject misguided calls to eliminate the program."},{"ELECTIONS: What federal policies do you support regarding campaign funding and voting rights?":"Our democracy depends on free and fair elections. I co-sponsored the Government by the People Act which increases transparency, encourages small contributions and establishes public financing. I introduced the Safeguarding Election Infrastructure Act which mandates a paper receipt for every ballot cast among other things. I also co-sponsored the Voter Empowerment Act of 2017, which requires states to make available online voter registration and protects against ballot tampering, and the Voting Rights Advancement Act, which restores voter protections in states with a history of discriminatory activity."}]},{"name":"Statewide Proposal 18-1","summary":"A proposed initiated law to authorize and legalize possession, use and cultivation of marijuana products by individuals who are at least 21 years of age and older, and commercial sales of marijuana through state-licensed retailers.","details":["Allow individuals 21 and older to purchase, possess  and use marijuana and marijuana-infused edibles, and grow up to 12 marijuana plants for personal consumption.","Impose a 10-ounce limit for marijuana kept at residences and require amounts over 2.5 ounces be secured in locked containers.","Create a state licensing system for marijuana businesses and allow municipalities to ban or restrict them.","Permit retail sales of marijuana and edibles subject to a 10% tax, dedicated to implementation costs, clinical trials, schools, roads, and municipalities where marijuana businesses are located.","Change several current violations from crimes to civil infractions."]},{"name":"Statewide Proposal 18-2","summary":"A proposed constitutional amendment to establish a commission of citizens with exclusive authority to adopt district boundaries for the Michigan Senate, Michigan House of Representatives and U.S. Congress, every 10 years.","details":["Create a commission of 13 registered voters randomly selected by the Secretary of State: 1) 4 each who self-identify as affiliated with the 2 major political parties; and 2) 5 who self-identify as unaffiliated with major political parties.","Prohibit partisan officeholders and candidates, their employees, certain relatives, and lobbyists from serving as commissioners.","Establish new redistricting criteria including geographically compact and contiguous districts of equal population, reflecting Michigan’s diverse population and communities of interest. Districts shall not provide disproportionate advantage to political parties or candidates.","Require an appropriation of funds for commission operations and commissioner compensation."]}]
