[{"name": "Bill Schuette", "party": "Republican", "bio": {"occupation": "Attorney General of Michigan", "education": "I am a graduate of Georgetown University's School of Foreign Service and studied at the University of Aberdeen, Scotland. I received my law degree from the University of San Francisco School of Law.", "qualifications": "Before becoming Michigan's 53rd Attorney General, I served as a judge on the Michigan Court of Appeals, a State Senator representing the 35th District, Director of the Michigan Department of Agriculture, and as a United States Congressman. My experience means I understand our state and know how to work with the legislature, local leaders and other partners on needed reforms to advance Michigan."}, "policies": [{"PRIORITIES: What are your top three priorities for the State of Michigan and how would you address them?": "My top priority can be summed up in one word: growth. Michigan needs a growing population and growing paychecks to become one of the leading states in the country economically. I want to cut taxes and regulations at the state level. Additionally, I will focus on cutting auto insurance rates and fixing our 3rd grade reading scores, which are some of the lowest in the nation. My GROW (Great Readers On the Way) plan will prioritize literacy with a cabinet-level literacy director and more. Together these things will make Michigan more attractive to job creators and people, allowing our state to grow again."}, {"EDUCATION: What measures do you support/propose to achieve improved educational outcomes and accessibility for Michigan students from early childhood through post-secondary education?": "I support policies that give families more great educational choices and make wise use of taxpayers’ $15 billion annual investment in our schools. My GROW plan will reverse Michigan’s 15-year decline in reading scores with a cabinet-level literacy director, reading coaches in every elementary school, tutoring and summer reading programs. My Paycheck Training Plan will restore a balance between career and college preparation in our schools and foster apprenticeships in skilled trades and other fields. We should grade our schools A-F and reward high performing and improving schools with grants and incentives."}, {"ECONOMY: What policies do you support to increase jobs and help Michigan residents improve their economic positions?": "As governor, I will implement growth-friendly policies that make Michigan attractive to job creators and families and help rebuild our population. I will cut taxes and regulation at the state level I want to eliminate the Granholm income tax hike that has cost Michigan taxpayers $8 billion. There isn’t a problem facing Michigan today that couldn’t be made better if we had more people living and working in Michigan. We need more people filling jobs and contributing the growth that will allow us to invest in better roads and improved infrastructure."}, {"ENVIRONMENT & ENERGY: What actions or policies do you support to protect Michigan’s water, air and land for current and future generations, while meeting the state’s energy needs? Explain how those actions or policies would affect the future of Enbridge Pipeline 5.": "Our Great Lakes are the crown jewels of Michigan and their safety and security is etched in the DNA of every Michigan resident. I support building a 4.5-mile-long utility tunnel in the Straits that puts all existing utility connections into one underground concrete tunnel which would protect the lines from hazards and would also contain possible spills. Michigan must maintain a regulatory climate that provides reliable and affordable energy. I support a review of energy policy to provide a mix of nuclear, clean coal, natural gas, renewables and to encourage more choices for businesses, consumers and families."}, {"EQUALITY: What, if any, specific steps will you take to address inequalities facing women in Michigan?": "As attorney general I have established a strong record as being a voice for victims of human trafficking and sexual assault. I helped secure funding to test thousands of abandoned rape kids in Detroit and across the state and set up a special unit to prosecute human traffickers. I prosecuted Larry Nassar and he is behind bars for life. I also prosecuted Kevin Beverly, who threatened and intimidated his ex-wife from prison. As governor, I will continue this legacy of seeking justice for women."}, {"JUSTICE: What policies will you pursue to promote social and racial justice in our state?": "As attorney general, I have consistently been a voice for victims, consumers and all Michiganians, because I believe everyone should be treated equally under the law, with dignity and respect. As governor, I will ensure such policies are practiced within my administration, and I will approach the laws and budgets I sign with the same standard in mind."}]},
{"name": "John James", "party": "Republican", "bio": {"occupation": "President of James Group International and CEO of Renaissance Global Logistics", "education": "United States Military Academy, Bachelor of Science Penn State University, Master of Supply Chain Management and Information Systems University of Michigan, Master of Business Administration (M.B.A.)", "qualifications": "I spent half of my adult life serving this country. I led two platoons in Iraq and brought all my men home to their families. The other half of my adult life was spent serving my community and creating jobs right here in Michigan. I served on the Michigan Veterans Trust Fund and the Board of Directors of the Jalen Rose Leadership Academy."}, "policies": [{"PRIORITIES: What are your top three national legislative priorities and how would you address them?": "1. Economic Opportunity. Putting in place a tax policy that helps create the environment where jobs can be created and where families keep more of what they earn to meet their needs. 2. National Security and Veterans. We also have to take care of our veterans. The toughest fight our forces face should not be in a VA hospital. This in particular is a priority for me when I reach the Senate. 3. Infrastructure. Upgrading the Soo Locks and our roads must become a national priority."}, {"IMMIGRATION: What are your concerns and plans regarding U.S. immigration polices?": "We are a nation of immigrants and a nation of laws. Our economy and national identity depend on a workable legal immigration system. But it needs to be tough as well. I oppose sanctuary cities and would work to ensure sanctuary cities are defunded. I also would work to ensure we have secure borders. I will work to support reform of the legal immigration system that provides greater security while supporting our economy."}, {"HEALTH CARE: What are your concerns and plans regarding U.S. health coverage policies and programs, including those affecting maternal and child health?": "We need to look at everything that comes in between a patient and their doctor. We must keep the decision making ability in the hands of doctors and health professionals. After that, we need to look at everything that happens after that patient walks out of the doctors office and has to pay for the care. We need to focus on patient-centered, market based solutions. Mothers and children across Michigan deserve better. Our Veterans deserve better."}, {"ECONOMY: What federal policies do you support to help members of all strata of the American public improve their economic positions?": "Michigan is one of the most innovative states in America. We are home to some of the most innovative manufacturing innovators in the world, and one of the most diverse agriculture sectors in the nation. Both of these important industries are sensitive to government regulation, tax and trade policy. The best thing the federal government can do in many cases is get out of the way. That means reducing regulation instead of increasing regulation. Putting in place a tax policy that helps create the environment where jobs can be created and where families keep more of what they earn to meet their needs."}, {"ENVIRONMENT & ENERGY: What policies do you support to meet U.S. energy needs while protecting our water, air and land for current and future generations? Explain how those actions or policies would affect the future of the Great Lakes.": "Our Great Lakes are a national treasure. They support a robust fish and tourism industry here in Michigan. We must protect the lakeshore and update infrastructure such as the Soo Locks to ensure the economic impact of the lakes to our state is not interrupted. I will champion policies and programs that protects environmental quality throughout the Great Lakes and protects them from invasive species like Asian Carp. The same applies to the land we farm and live on and the air we breathe. We enjoy an incredible agricultural diversity in this state and need to guarantee it for future seasons."}, {"ELECTIONS: What federal policies do you support regarding campaign funding and voting rights?": "As a cadet in the U.S. Military Academy at West Point, I swore an oath to support and defend the Constitution. Voting and sharing our opinions and values is how we pass on our democracy to future generations. We must protect the integrity of our elections and protect against voter fraud. It is equally important that we maintain a campaign finance system that is honest, transparent and accessible by every American citizen. When you take away an American's right to vote or their right to share their views, you hurt our democracy."}]},
{"name": "Jeff Jones", "party": "Republican", "bio": {"occupation": "Pastor God's Family Room; Financial Adviser Mass Mutual; Entrepreneur 812 Enterprise.", "education": "Crestwood High School Dbn Hts,MI; University of Michigan EE; Hyles-Anderson College Crown Point,IN", "qualifications": "30+ years Executive Management; Vice-President PPS, Inc. President CTI; RVP Health Insurance; 10 years Urban Ministry; 25 Years Suburban Ministries & Pastorate; 20 years Landscape Design Build; 5 Years Rural Pastorate; 10 years Life Targeting Coach; Independent Candidate U.S. Senate 2014; GOP Candidate U.S. House MI-12 2016; GOP Candidate U.S. House MI-12 2018."}, "policies": [{"PRIORITIES: What are your top three national legislative priorities and how would you address them?": "1) Educational Renaissance... It is about allowing students to experience education, teachers to draw out knowledge, and equipping the teachers and student with necessary funding to accomplish those goals. 2) Economic Revitalization... New technologies exist that I have worked on that can bring great diversification and flexibility to the workforce, research, and new industries awaiting opportunity to bring great economic growth and resourceful environment and clean, renewable, and sustainable energy to our communities. 3) Health Care Reform for all Americans that become budget based, supplemental, and cost effective"}, {"IMMIGRATION: What are your concerns and plans regarding U.S. immigration policy?": "Amnesties, new implementation of technology for entry and tracking, reduction of time to qualify, assimilate, and continue the great opportunities of legal immigration, while securing the safety of community. I have a plan that will lighten the burdens of U.S expenses and expand the international accountability of refugees and genuine relocation and assimilation of the international community. There is growth and opportunity in genuine reconstruction of our borders that would add jobs, ethical resolve, and innovation. Legal immigration gives opportunity to innovation, migrant workers, and shared education."}, {"HEALTH CARE: What are your concerns and plans regarding U.S. health care policies and programs, including those affecting maternal and child health?": "Accountable and Affordable Health Care is very possible in the United States through educational, fiscal appropriations, and responsible management. Health care involves everybody. The healthy. Alternative choices. Social responsibility. Maternal. Paternal. Child Care. Veterans, Seniors. Mental health. Addicted. And billing.These are all impacted by agencies, pharmaceuticals, FDA, USDA, EPA, DFIS, and even the Dept of Labor. Automotive No Fault is extremely impacted. There is ethical resolve available for each circumstance. The healthy should not be penalized for their lifestyle and choices available to everyone."}, {"ECONOMY: What federal policies do you support to help members of all strata of the American public improve their economic positions?": "Keeping jobs in America is a priority. NAFTA & the TPA are destructive to the community of the 12th. So, foreign trade, funding the TPA, and the EX/IM Bank are extremely detrimental to American jobs. While Wall Street has proven prosperous in the recent short term, but education and an understanding of statistics run a cycle. Simple math and the education of the rules of 72, understanding debt, and how money works globally play an important part of overall economics. Most are unfamiliar with what the Federal Reserve represents and how our economic system works. What is relative about the price of tea in China?"}, {"ENVIRONMENT & ENERGY: What policies do you support to meet U.S. energy needs while protecting our water, air and land for current and future generations? Explain how those actions or policies would affect the future of the Great Lakes.": "Understanding what has caused the algae problems in Erie, the lower water levels and erosion in Lake Michigan, The Asian Carp in Huron and Ontario, and the eco-system of Superior are extremely important to the next generation, as well as, the immediate of concerns to us all can be overwhelming. Some has to do with what is happening inland to our lakes and streams. Unfortunately, lobbying dollars impacts us all and our environment and the payback of debt in elections. There are new innovative systems to assure zero pollution output, while maintaining maximum performance locally and independence on foreign energy."}, {"ELECTIONS: What federal policies do you support regarding campaign funding and voting rights?": "It was the GOP that led the recognition of all Americans to vote, the Suffrage Cause, and the abuses of federal campaign dollars. Most do not realize that based on population and census, we waste billions possibly trillions, on Congressional Districting that does not even represent U.S. Citizens. Based on Undocumented residents, almost 14 Congressional Districts are funded in this abuse of Taxpayer dollars. The Congress terms should be 6 years and limited to 2 cycles. Lobbying dollars should be limited on actual placement. I have suggestions on how to preserve our voting rights and expose the abuses."}]},
{"name": "Statewide Proposal 18-3", "summary": " A proposal to authorize automatic and Election Day voter registration, no-reason absentee voting, and straight ticket voting; and add current legal requirements for military and overseas voting and postelection audits to the Michigan Constitution", "details": ["Become automatically registered to vote when applying for, updating or renewing a driver’s license or state-issued personal identification card, unless the person declines.", "Simultaneously register to vote with proof of residency and obtain a ballot during the 2-week period prior to an election, up to and including Election Day.", "Obtain an absent voter ballot without providing a reason.", "Cast a straight-ticket vote for all candidates of a particular political party when voting in a partisan general election."]},
{"name": "Michigan Governor", "duties": "The state's executive powers are vested in the Governor."},
{"name": "U.S. Senate", "duties": "U.S. Senators share the responsibility with U.S. Representatives for enactment of the nation's laws as provided in the U.S. Constitution.  Senators ratify international treaties and confirm Presidential appointments of Cabinet members, federal judges, and foreign ambassadors."},
{"name": "U.S. House, District 12", "duties": "Representatives share the responsibility with Senators  for enactment of the nation's laws as provided in the U.S. Constitution.  Laws that require payment of taxes are initiated in the House of Representatives."}]
